<template>
  <div class="home">
    <h1> Test Task</h1>
       <div class="task container">
        Создать Vue.js CRUD application с хранением данных в local storage. <br>

Приложение состоит из двух страниц.<br>

Страница 1. <br>
На первой странице отображается таблица сохраненных данных.<br>
В таблице поля: "name" "surname" "phone" "email" и кнопки "delete" "edit"<br>

Над таблицей кнопка "Add user"<br>

Кнопки "Add user" и "edit" ведут на страницу №2<br>

Страница 2.<br>
На странице можно добавлять или редактировать уже существующие записи. (поля "name" "surname" "phone" "email")<br>
При редактировании в полях должны загружаться соответствующие данные.<br>

Также на этой странице можно импортировать данные из JSON массива.<br>
Пользователь вводит в  отдельное поле "Import JSON" JSON массив, приложение его парсит и сохраняет.<br>

Все данные таблицы должны храниться в локальном хранилище.<br>
    </div>
  </div>
</template>
<script>


export default {
    
}
</script>